Ran Plan for dir: `terraform/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_instance.myec2vm[1] will be destroyed
  # (because index [1] is out of range for count)
- resource "aws_instance" "myec2vm" {
      - ami                                  = "ami-05548f9cecf47b442" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:520291287938:instance/i-04b2aa006e60ce798" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-04b2aa006e60ce798" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.small" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "terraform-key" -> null
      - monitoring                           = false -> null
      - placement_partition_number           = 0 -> null
      - primary_network_interface_id         = "eni-0f440ffd70fbd2906" -> null
      - private_dns                          = "ip-172-31-31-76.ec2.internal" -> null
      - private_ip                           = "172.31.31.76" -> null
      - public_dns                           = "ec2-100-26-100-95.compute-1.amazonaws.com" -> null
      - public_ip                            = "100.26.100.95" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "vpc-ssh",
          - "vpc-web",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-06cc53503bb19ff60" -> null
      - tags                                 = {
          - "Name" = "Atlantis_Eval_Count_1"
        } -> null
      - tags_all                             = {
          - "Name" = "Atlantis_Eval_Count_1"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "d27a7be0897045fdd3ca533a5b86bb758987e79f" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-08aa489306a95159a",
          - "sg-09b89cc96a522cf62",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-006c1995bf3b62eb7" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
        }
    }

  # aws_s3_bucket.atlantis will be created
+ resource "aws_s3_bucket" "atlantis" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "atlantisTesting"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Dev"
          + "Name"        = "atlantisTesting"
        }
      + tags_all                    = {
          + "Environment" = "Dev"
          + "Name"        = "atlantisTesting"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.example will be created
+ resource "aws_s3_bucket_acl" "example" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
~ for_output_list                 = [
        "ec2-52-90-45-196.compute-1.amazonaws.com",
      - "ec2-100-26-100-95.compute-1.amazonaws.com",
    ]
~ for_output_map1                 = {
      - i-04b2aa006e60ce798 = "ec2-100-26-100-95.compute-1.amazonaws.com"
        # (1 unchanged attribute hidden)
    }
~ for_output_map2                 = {
      - "1" = "ec2-100-26-100-95.compute-1.amazonaws.com"
        # (1 unchanged attribute hidden)
    }
~ latest_splat_instance_publicdns = [
        "ec2-52-90-45-196.compute-1.amazonaws.com",
      - "ec2-100-26-100-95.compute-1.amazonaws.com",
    ]
~ legacy_splat_instance_publicdns = [
        "ec2-52-90-45-196.compute-1.amazonaws.com",
      - "ec2-100-26-100-95.compute-1.amazonaws.com",
    ]
Releasing state lock. This may take a few moments...
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://c5c1-2601-282-167f-db10-35b9-e3b1-28cf-fda4.ngrok-free.app/lock?id=pseudonative%252FATLANTIS%252Fterraform%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/dev`
</details>
Plan: 2 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`